Martinsbl/nrf5-mpu-examples/nrf5-ble-uart-mpu-data-ready-interrupts/main.c
        // Read accelerometer data.
        err_code = mpu_read_accel(&acc_values);
        APP_ERROR_CHECK(err_code);
        
        
        nrf_gpio_pin_clear(LED_3); // Set LED_3 pin high to measure how long it takes to format string.
        // Divide each accelerometer axis to get values in G
        x = (float)acc_values.x / 0x4000;
        y = (float)acc_values.y / 0x4000;
        z = (float)acc_values.z / 0x4000;
        sprintf(ble_value_string, "%.02f;%.02f;%.02f;\n", x, y, z); // Format string with data. 
        nrf_gpio_pin_set(LED_3);
        
        if(m_conn_handle != BLE_CONN_HANDLE_INVALID) // Check if we are in a connection
        {
            // Send data via NUS
            err_code = ble_nus_string_send(&m_nus, (uint8_t *)ble_value_string, sizeof(ble_value_string));
            
            if(err_code == BLE_ERROR_NO_TX_PACKETS) // BLE_ERROR_NO_TX_PACKETS means there are no more available send buffers. If this occurs print messages to terminal.
            {
                buffer_overflow++;
                printf("TX overflow #%d\n", buffer_overflow);
            }
            else if(err_code != NRF_ERROR_INVALID_STATE) // The function returns error 0x8 if CCCD is not enabled before we call ble_nus_string_send(). It works anyway so we ignore this error.
            {
                APP_ERROR_CHECK(err_code);
            }
        }
            
        // Print values to Terminal if desirable
        //printf(ble_value_string);
        mpu_data_ready = false;
    }
}


/** 
 * @}
 */
